{
    "entries" : [
        {
            "title" : "Joe's Adventure",
            "genre": "Adventure",
            "author" : "Jack Johnson",
            "release date" : "1/21/2024",
            "description" : "This game is about a boy named Joe who lost his bike, so he takes an attempt to fetch it back from the person who stole it from him, first having to find out who it is. He navigates through thousands of obstances, hopping from one world to another, visitng 7 different worlds. He finally meets the guys who stole is bike and hopes to take it back."
        },
        {
            "title" : "War Lords",
            "genre": "Action",
            "author" : "Jack Johnson",
            "release date" : "1/21/2024",
            "description" : "This is a multiplayer online battle royale game where each player controls the character of a ninja, viking, cowboy, pirate, or a gladiator. They battle each other until only one remains alive, with everyone else eliminated."
        },
        {
            "title" : "James and the Giant Iguana",
            "genre": "Adventure",
            "author" : "Jonathan Buckman",
            "release date" : "4/25/2025",
            "description" : "This is a mystery game where a police detective named James in on the hunt for a mischievous giant iguana who stole his lemonade. Playing as him, you will navigate through multiple stages until you reach the iguana's cave where you end up in a massive battle with him. Once you defeat him, you get your lemonade back."
        },
        {
            "title" : "U.S.A. Winter Olympics",
            "genre": "Sports",
            "author" : "Joseph Bartleman",
            "release date" : "7/8/2014",
            "description" : "In this game, you have various different options of which sports to play, while they all take place in an olympics stadius during winter. There are multiple sports, including downhill skiing, cross-country skiing, shoeshoeing, snowboarding, bobsleigh, and so on. You can compete online or locally, whether in single-player mode or multi-player mode."
        },
        {
            "title" : "High School Football Madness",
            "genre": "Sports",
            "author" : "Joseph Bartleman",
            "release date" : "9/17/2023",
            "description" : "You are playing a high school football player. You can play the story mode, where you play for the Wayback High School team and beat all the other teams to gain a trophy. In the casual, mode you can pick any team which will be represented by different high schools and play against another player or a CPU."
        },
        {
            "title" : "Pong Kong",
            "genre": "Sports",
            "author" : "Hayden Mitchell",
            "release date" : "8/19/2019",
            "description" : "This game takes place in Hong Kong, China where each player from a different state of China competes in a national ping pong tournament. You can pick whichever state you want to play for and play against other players online, who represent other team."
        },
        {
            "title" : "Chocolate World",
            "genre": "Platformer",
            "author" : "Bert Johnson",
            "release date" : "9/10/2022",
            "description" : "In this 2D platformer game, you play the character ChocoBoy, a boy made of chocolate. He travels through nine different worlds, trying to bring back all the candies that his enemy, Mr. Smirkz, steals from a huge candy store in Boston."
        },
        {
            "title" : "Boxing King",
            "genre": "Fighting",
            "author" : "Bert Johnson",
            "release date" : "4/25/2022",
            "description" : "You play the character of a well-known boxer, Tyke Byson, and your mission is to beat all the enemies who have troubled you in your life each in a boxing match. For each one you beat, you gain a medal. Once you collect all medals, you become a well-known boxing superstar and your name will be written everywhere."
        },
        {
            "title" : "Blox Builder",
            "genre": "Sandbox",
            "author" : "Adam Fitzgerald",
            "release date" : "1/19/2017",
            "description" : "This battle royale game lets you build whatever world you want using Roblox-style objects. Once you build your world, it will be public, and you can battle others who join. You can also join worlds created by others and battle. You can battle in singles, duos, or trios, quads, or quintuples."
        }
    ]
}